# Setup

This is following [10 minutes to pandas](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html) for Pandas (v 2.x.x, as of this writing) but may take a little more than 10 minutes to finish. Lot's of small changes, references etc.

You can also open this notebook in Google Colab

<a href="https://colab.research.google.com/github/shauryashaurya/learn-data-munging/blob/main/01.001%20-%2010%2B%20minutes%20to%20pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.__version__

'1.24.4'

In [3]:
pd.__version__

'2.0.3'

# Object creation

In [4]:
# Series - pass a list to pd.Series
s1 = pd.Series([1, 2, 3, np.nan, 5])

In [5]:
s1

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
dtype: float64

In [6]:
# create an index to use in the dataframe
# default frequency is D (day), so creates a DatetimeIndex of 10 days
dates = pd.date_range('20220619', periods=10)
dates

DatetimeIndex(['2022-06-19', '2022-06-20', '2022-06-21', '2022-06-22',
               '2022-06-23', '2022-06-24', '2022-06-25', '2022-06-26',
               '2022-06-27', '2022-06-28'],
              dtype='datetime64[ns]', freq='D')

just in case you are wondering, here's [all the "offset aliases"](https://pandas.pydata.org/docs/user_guide/timeseries.html#timeseries-offset-aliases) for Datetime

In [7]:
# Dataframe - pass a Numpy array
# create a 10 row, 4 col random number array, index by dates, give some column names
df = pd.DataFrame(np.random.randn(10, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2022-06-19  0.516849  2.195446 -0.431615 -0.846499
2022-06-20  1.154874 -0.760429 -1.780735  1.034406
2022-06-21 -0.916348  0.976161 -0.450536 -0.975293
2022-06-22  0.628617  0.537878 -2.067756 -0.660797
2022-06-23  0.274019 -0.560243  0.089445 -0.041778
2022-06-24  0.317767 -0.304653 -0.395611 -0.599631
2022-06-25 -0.048513  0.653577  0.539982  0.397480
2022-06-26 -0.158157 -0.073843 -0.141581  1.142416
2022-06-27  0.525284 -0.979729  0.345773 -2.189424
2022-06-28  1.891567  0.348871 -1.245213  1.570340

In [8]:
# Create a dataframe by passing a dictionary of objects
# where each object can be converted into a series-like structure
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20220619"),
        "C": pd.Series(1, index=list(range(6)), dtype="float32"),
        "D": np.array([3]*6, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train", "test", "train"]),
        "F": list("foofoo"),
        "G": "foo"
    }
)

df2

     A          B    C  D      E  F    G
0  1.0 2022-06-19  1.0  3   test  f  foo
1  1.0 2022-06-19  1.0  3  train  o  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
3  1.0 2022-06-19  1.0  3  train  f  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo

In [9]:
# the datatype of each of the columns would be different
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
G            object
dtype: object

# Viewing Data

In [10]:
# top of the dataframe
df.head()

                   A         B         C         D
2022-06-19  0.516849  2.195446 -0.431615 -0.846499
2022-06-20  1.154874 -0.760429 -1.780735  1.034406
2022-06-21 -0.916348  0.976161 -0.450536 -0.975293
2022-06-22  0.628617  0.537878 -2.067756 -0.660797
2022-06-23  0.274019 -0.560243  0.089445 -0.041778

In [11]:
# bottom 3 records of the dataframe
df.tail(3)

                   A         B         C         D
2022-06-26 -0.158157 -0.073843 -0.141581  1.142416
2022-06-27  0.525284 -0.979729  0.345773 -2.189424
2022-06-28  1.891567  0.348871 -1.245213  1.570340

In [12]:
# index of the df
df.index

DatetimeIndex(['2022-06-19', '2022-06-20', '2022-06-21', '2022-06-22',
               '2022-06-23', '2022-06-24', '2022-06-25', '2022-06-26',
               '2022-06-27', '2022-06-28'],
              dtype='datetime64[ns]', freq='D')

In [13]:
# columns of the df
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
# .to_numpy gives a NumPy representation of the dataframe
# this is expensive if all columns are of different data type
df.to_numpy()

array([[ 0.51684911,  2.19544599, -0.43161536, -0.84649899],
       [ 1.15487386, -0.76042877, -1.78073515,  1.03440604],
       [-0.9163477 ,  0.97616104, -0.45053593, -0.97529255],
       [ 0.62861706,  0.53787837, -2.0677556 , -0.66079723],
       [ 0.27401925, -0.56024263,  0.08944492, -0.04177786],
       [ 0.31776655, -0.30465295, -0.3956105 , -0.59963148],
       [-0.04851341,  0.65357656,  0.53998183,  0.39748043],
       [-0.15815713, -0.07384349, -0.14158105,  1.14241592],
       [ 0.52528434, -0.97972945,  0.34577335, -2.18942385],
       [ 1.89156719,  0.34887077, -1.2452128 ,  1.57034006]])

In [15]:
df2.to_numpy()

array([[1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'f',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'f',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'o',
        'foo']], dtype=object)

In [16]:
# quick summary stats
df.describe()

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean    0.418596   0.203304  -0.553785  -0.116878
std     0.755783   0.951490   0.876570   1.160544
min    -0.916348  -0.979729  -2.067756  -2.189424
25%     0.032120  -0.496345  -1.046544  -0.800074
50%     0.417308   0.137514  -0.413613  -0.320705
75%     0.602784   0.624652   0.031688   0.875175
max     1.891567   2.195446   0.539982   1.570340

1. **count** = Count number of non-NA/null observations
1. **max** = Maximum of the values in the object
1. **min** = Minimum of the values in the object
1. **mean** = Mean of the values
1. **std** = Standard deviation of the observations
1. **25%** = Default lower percentile
1. **50%** = 50 percentile - same as the median 
1. **75%** = Default upper percentile

In [17]:
# change the percentiles
df.describe(percentiles=[.1, .5, .9])

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean    0.418596   0.203304  -0.553785  -0.116878
std     0.755783   0.951490   0.876570   1.160544
min    -0.916348  -0.979729  -2.067756  -2.189424
10%    -0.233976  -0.782359  -1.809437  -1.096706
50%     0.417308   0.137514  -0.413613  -0.320705
90%     1.228543   1.098090   0.365194   1.185208
max     1.891567   2.195446   0.539982   1.570340

In [18]:
# E, F, G in d2 are not numeric, so do not come up in describe()
df2.describe()

         A                    B    C    D
count  6.0                    6  6.0  6.0
mean   1.0  2022-06-19 00:00:00  1.0  3.0
min    1.0  2022-06-19 00:00:00  1.0  3.0
25%    1.0  2022-06-19 00:00:00  1.0  3.0
50%    1.0  2022-06-19 00:00:00  1.0  3.0
75%    1.0  2022-06-19 00:00:00  1.0  3.0
max    1.0  2022-06-19 00:00:00  1.0  3.0
std    0.0                  NaN  0.0  0.0

In [19]:
# transpose the data
# turn rows to columns and vice versa
df.T

,2022-06-19,2022-06-20,2022-06-21,2022-06-22,2022-06-23,2022-06-24,2022-06-25,2022-06-26,2022-06-27,2022-06-28
A,0.516849,1.154874,-0.916348,0.628617,0.274019,0.317767,-0.048513,-0.158157,0.525284,1.891567
B,2.195446,-0.760429,0.976161,0.537878,-0.560243,-0.304653,0.653577,-0.073843,-0.979729,0.348871
C,-0.431615,-1.780735,-0.450536,-2.067756,0.089445,-0.395611,0.539982,-0.141581,0.345773,-1.245213
D,-0.846499,1.034406,-0.975293,-0.660797,-0.041778,-0.599631,0.397480,1.142416,-2.189424,1.570340

### [Axis in pandas](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.set_axis.html?highlight=set_ax#pandas.DataFrame.set_axis)

```axis{0 or ‘index’, 1 or ‘columns’}```

Always remember that when you specify:
* ```axis=0``` or ```axis='index'``` you indicate that the operation should be along the _index_ (aka across the rows). More often than not indexes will go from top to bottom (vertically), but sometimes they may not (for e.g. if you use columns as index or when you have hierarchical or multi-index data).
* ```axis=1``` or ```axis='columns'``` indicates the operation is along the columns

When in doubt use the explicit version ```'index'``` or ```'columns'``` instead of ```0``` or ```1```

In [20]:
# sort along the axis - 1 = horizontal
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2022-06-19 -0.846499 -0.431615  2.195446  0.516849
2022-06-20  1.034406 -1.780735 -0.760429  1.154874
2022-06-21 -0.975293 -0.450536  0.976161 -0.916348
2022-06-22 -0.660797 -2.067756  0.537878  0.628617
2022-06-23 -0.041778  0.089445 -0.560243  0.274019
2022-06-24 -0.599631 -0.395611 -0.304653  0.317767
2022-06-25  0.397480  0.539982  0.653577 -0.048513
2022-06-26  1.142416 -0.141581 -0.073843 -0.158157
2022-06-27 -2.189424  0.345773 -0.979729  0.525284
2022-06-28  1.570340 -1.245213  0.348871  1.891567

In [21]:
# sort along the axis - 0 = vertical
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2022-06-28  1.891567  0.348871 -1.245213  1.570340
2022-06-27  0.525284 -0.979729  0.345773 -2.189424
2022-06-26 -0.158157 -0.073843 -0.141581  1.142416
2022-06-25 -0.048513  0.653577  0.539982  0.397480
2022-06-24  0.317767 -0.304653 -0.395611 -0.599631
2022-06-23  0.274019 -0.560243  0.089445 -0.041778
2022-06-22  0.628617  0.537878 -2.067756 -0.660797
2022-06-21 -0.916348  0.976161 -0.450536 -0.975293
2022-06-20  1.154874 -0.760429 -1.780735  1.034406
2022-06-19  0.516849  2.195446 -0.431615 -0.846499

In [22]:
# sort ascending by values in a column
df.sort_values(by="A")

                   A         B         C         D
2022-06-21 -0.916348  0.976161 -0.450536 -0.975293
2022-06-26 -0.158157 -0.073843 -0.141581  1.142416
2022-06-25 -0.048513  0.653577  0.539982  0.397480
2022-06-23  0.274019 -0.560243  0.089445 -0.041778
2022-06-24  0.317767 -0.304653 -0.395611 -0.599631
2022-06-19  0.516849  2.195446 -0.431615 -0.846499
2022-06-27  0.525284 -0.979729  0.345773 -2.189424
2022-06-22  0.628617  0.537878 -2.067756 -0.660797
2022-06-20  1.154874 -0.760429 -1.780735  1.034406
2022-06-28  1.891567  0.348871 -1.245213  1.570340

In [23]:
# sort by non-numerical values
df2.sort_values(by="F", ascending=False)

     A          B    C  D      E  F    G
1  1.0 2022-06-19  1.0  3  train  o  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo
0  1.0 2022-06-19  1.0  3   test  f  foo
3  1.0 2022-06-19  1.0  3  train  f  foo

In [24]:
# sort by two or more columns
df2.sort_values(by=["F", "E"])

     A          B    C  D      E  F    G
0  1.0 2022-06-19  1.0  3   test  f  foo
3  1.0 2022-06-19  1.0  3  train  f  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
1  1.0 2022-06-19  1.0  3  train  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo

# Selection

For production prefer the following instead of other data access methods (typical python methods like ["col"] or [a:b] slices etc.):

```.at, .iat, .loc and .iloc.```

## Getting

In [25]:
# selecting a single column returns a Series object
df["A"]

2022-06-19    0.516849
2022-06-20    1.154874
2022-06-21   -0.916348
2022-06-22    0.628617
2022-06-23    0.274019
2022-06-24    0.317767
2022-06-25   -0.048513
2022-06-26   -0.158157
2022-06-27    0.525284
2022-06-28    1.891567
Freq: D, Name: A, dtype: float64

In [26]:
# selecting a slice
df[1:5]

                   A         B         C         D
2022-06-20  1.154874 -0.760429 -1.780735  1.034406
2022-06-21 -0.916348  0.976161 -0.450536 -0.975293
2022-06-22  0.628617  0.537878 -2.067756 -0.660797
2022-06-23  0.274019 -0.560243  0.089445 -0.041778

## Selection by label

In [27]:
# selecting based on a label
df.loc[dates[0]]

A    0.516849
B    2.195446
C   -0.431615
D   -0.846499
Name: 2022-06-19 00:00:00, dtype: float64

In [28]:
# select on a multi-axis by lable
# I honestly do not know what the comment above means...help!
df.loc[:, ["A", "B"]]

                   A         B
2022-06-19  0.516849  2.195446
2022-06-20  1.154874 -0.760429
2022-06-21 -0.916348  0.976161
2022-06-22  0.628617  0.537878
2022-06-23  0.274019 -0.560243
2022-06-24  0.317767 -0.304653
2022-06-25 -0.048513  0.653577
2022-06-26 -0.158157 -0.073843
2022-06-27  0.525284 -0.979729
2022-06-28  1.891567  0.348871

In [29]:
# specific index value results in reduction of dimensions
res = df.loc["2022-06-20"]
print(res)
print("res.shape = ", res.shape, " vs. df.shape = ", df.shape)

A    1.154874
B   -0.760429
C   -1.780735
D    1.034406
Name: 2022-06-20 00:00:00, dtype: float64
res.shape =  (4,)  vs. df.shape =  (10, 4)

In [30]:
# get to a specific scalar:
#
# method one
df.loc[dates[0], "A"]

0.5168491129830927

In [31]:
#
# method two (slightly faster than method one)
df.at[dates[0], "A"]

0.5168491129830927

## Selection by position

In [32]:
df.iloc[2]

A   -0.916348
B    0.976161
C   -0.450536
D   -0.975293
Name: 2022-06-21 00:00:00, dtype: float64

In [33]:
# slices - similar to NumPy / Python - [row:slice, col:slice]
df.iloc[1:5, 0:2]

                   A         B
2022-06-20  1.154874 -0.760429
2022-06-21 -0.916348  0.976161
2022-06-22  0.628617  0.537878
2022-06-23  0.274019 -0.560243

In [34]:
# by list of locations - similar to NumPy / Python - [[list of rows], [list of cols]]
df.iloc[[0, 1, 2, 6], [0, 2]]

                   A         C
2022-06-19  0.516849 -0.431615
2022-06-20  1.154874 -1.780735
2022-06-21 -0.916348 -0.450536
2022-06-25 -0.048513  0.539982

In [35]:
# by list of locations - similar to NumPy / Python - [[list of rows], [list of cols]]
# change the order of columns, repeact a column
df.iloc[[0, 1, 2, 6], [2, 1, 0, 2]]

                   C         B         A         C
2022-06-19 -0.431615  2.195446  0.516849 -0.431615
2022-06-20 -1.780735 -0.760429  1.154874 -1.780735
2022-06-21 -0.450536  0.976161 -0.916348 -0.450536
2022-06-25  0.539982  0.653577 -0.048513  0.539982

In [36]:
# slice rows explicitly, keep all columns
df.iloc[[1, 2], :]

                   A         B         C         D
2022-06-20  1.154874 -0.760429 -1.780735  1.034406
2022-06-21 -0.916348  0.976161 -0.450536 -0.975293

In [37]:
# slice columns, keep all rows
df.iloc[:, [2, 3]]

                   C         D
2022-06-19 -0.431615 -0.846499
2022-06-20 -1.780735  1.034406
2022-06-21 -0.450536 -0.975293
2022-06-22 -2.067756 -0.660797
2022-06-23  0.089445 -0.041778
2022-06-24 -0.395611 -0.599631
2022-06-25  0.539982  0.397480
2022-06-26 -0.141581  1.142416
2022-06-27  0.345773 -2.189424
2022-06-28 -1.245213  1.570340

In [38]:
# everything, because you can
df.iloc[:, :]

                   A         B         C         D
2022-06-19  0.516849  2.195446 -0.431615 -0.846499
2022-06-20  1.154874 -0.760429 -1.780735  1.034406
2022-06-21 -0.916348  0.976161 -0.450536 -0.975293
2022-06-22  0.628617  0.537878 -2.067756 -0.660797
2022-06-23  0.274019 -0.560243  0.089445 -0.041778
2022-06-24  0.317767 -0.304653 -0.395611 -0.599631
2022-06-25 -0.048513  0.653577  0.539982  0.397480
2022-06-26 -0.158157 -0.073843 -0.141581  1.142416
2022-06-27  0.525284 -0.979729  0.345773 -2.189424
2022-06-28  1.891567  0.348871 -1.245213  1.570340

In [39]:
# get to a scalar (2 methods, just like before)
#
# method one: use iloc
df.iloc[1, 2]

-1.7807351489834937

In [40]:
#
# method two: use iat
df.iat[1, 2]

-1.7807351489834937

## Boolean Indexing

In [41]:
# use a value found in a single col to get data
df[df["A"] > 0]

                   A         B         C         D
2022-06-19  0.516849  2.195446 -0.431615 -0.846499
2022-06-20  1.154874 -0.760429 -1.780735  1.034406
2022-06-22  0.628617  0.537878 -2.067756 -0.660797
2022-06-23  0.274019 -0.560243  0.089445 -0.041778
2022-06-24  0.317767 -0.304653 -0.395611 -0.599631
2022-06-27  0.525284 -0.979729  0.345773 -2.189424
2022-06-28  1.891567  0.348871 -1.245213  1.570340

In [42]:
# boolean across the entire DF - vals that don't match go NaN
df[df > 0]

                   A         B         C         D
2022-06-19  0.516849  2.195446       NaN       NaN
2022-06-20  1.154874       NaN       NaN  1.034406
2022-06-21       NaN  0.976161       NaN       NaN
2022-06-22  0.628617  0.537878       NaN       NaN
2022-06-23  0.274019       NaN  0.089445       NaN
2022-06-24  0.317767       NaN       NaN       NaN
2022-06-25       NaN  0.653577  0.539982  0.397480
2022-06-26       NaN       NaN       NaN  1.142416
2022-06-27  0.525284       NaN  0.345773       NaN
2022-06-28  1.891567  0.348871       NaN  1.570340

In [43]:
# add another column
df11 = df.copy()
df11["E"] = ["one", "two", "three", "four",
             "two", "five", "one", "two", "three", "four"]
df11

                   A         B         C         D      E
2022-06-19  0.516849  2.195446 -0.431615 -0.846499    one
2022-06-20  1.154874 -0.760429 -1.780735  1.034406    two
2022-06-21 -0.916348  0.976161 -0.450536 -0.975293  three
2022-06-22  0.628617  0.537878 -2.067756 -0.660797   four
2022-06-23  0.274019 -0.560243  0.089445 -0.041778    two
2022-06-24  0.317767 -0.304653 -0.395611 -0.599631   five
2022-06-25 -0.048513  0.653577  0.539982  0.397480    one
2022-06-26 -0.158157 -0.073843 -0.141581  1.142416    two
2022-06-27  0.525284 -0.979729  0.345773 -2.189424  three
2022-06-28  1.891567  0.348871 -1.245213  1.570340   four

In [44]:
# the isin() query - basically the in clause
df11[df11["E"].isin(["two", "five"])]

                   A         B         C         D     E
2022-06-20  1.154874 -0.760429 -1.780735  1.034406   two
2022-06-23  0.274019 -0.560243  0.089445 -0.041778   two
2022-06-24  0.317767 -0.304653 -0.395611 -0.599631  five
2022-06-26 -0.158157 -0.073843 -0.141581  1.142416   two

## Setting values

In [45]:
# matching indexes auto-aligns values
s1 = pd.Series(range(11, 21), index=pd.date_range('20220619', periods=10))
s1

2022-06-19    11
2022-06-20    12
2022-06-21    13
2022-06-22    14
2022-06-23    15
2022-06-24    16
2022-06-25    17
2022-06-26    18
2022-06-27    19
2022-06-28    20
Freq: D, dtype: int64

In [46]:
df["F"] = s1
df

                   A         B         C         D   F
2022-06-19  0.516849  2.195446 -0.431615 -0.846499  11
2022-06-20  1.154874 -0.760429 -1.780735  1.034406  12
2022-06-21 -0.916348  0.976161 -0.450536 -0.975293  13
2022-06-22  0.628617  0.537878 -2.067756 -0.660797  14
2022-06-23  0.274019 -0.560243  0.089445 -0.041778  15
2022-06-24  0.317767 -0.304653 -0.395611 -0.599631  16
2022-06-25 -0.048513  0.653577  0.539982  0.397480  17
2022-06-26 -0.158157 -0.073843 -0.141581  1.142416  18
2022-06-27  0.525284 -0.979729  0.345773 -2.189424  19
2022-06-28  1.891567  0.348871 -1.245213  1.570340  20

In [47]:
# setting values by label and position
# first let's make a quick copy
df12 = df.copy()
df12

                   A         B         C         D   F
2022-06-19  0.516849  2.195446 -0.431615 -0.846499  11
2022-06-20  1.154874 -0.760429 -1.780735  1.034406  12
2022-06-21 -0.916348  0.976161 -0.450536 -0.975293  13
2022-06-22  0.628617  0.537878 -2.067756 -0.660797  14
2022-06-23  0.274019 -0.560243  0.089445 -0.041778  15
2022-06-24  0.317767 -0.304653 -0.395611 -0.599631  16
2022-06-25 -0.048513  0.653577  0.539982  0.397480  17
2022-06-26 -0.158157 -0.073843 -0.141581  1.142416  18
2022-06-27  0.525284 -0.979729  0.345773 -2.189424  19
2022-06-28  1.891567  0.348871 -1.245213  1.570340  20

In [48]:
# set by label
df12.at[dates[0], "A"] = 0
# set by position
df12.iat[0, 1] = 0
df12

                   A         B         C         D   F
2022-06-19  0.000000  0.000000 -0.431615 -0.846499  11
2022-06-20  1.154874 -0.760429 -1.780735  1.034406  12
2022-06-21 -0.916348  0.976161 -0.450536 -0.975293  13
2022-06-22  0.628617  0.537878 -2.067756 -0.660797  14
2022-06-23  0.274019 -0.560243  0.089445 -0.041778  15
2022-06-24  0.317767 -0.304653 -0.395611 -0.599631  16
2022-06-25 -0.048513  0.653577  0.539982  0.397480  17
2022-06-26 -0.158157 -0.073843 -0.141581  1.142416  18
2022-06-27  0.525284 -0.979729  0.345773 -2.189424  19
2022-06-28  1.891567  0.348871 -1.245213  1.570340  20

In [49]:
# kinda bigger replacement
df12.loc[:, "D"] = np.array([5]*len(df))
df12

                   A         B         C    D   F
2022-06-19  0.000000  0.000000 -0.431615  5.0  11
2022-06-20  1.154874 -0.760429 -1.780735  5.0  12
2022-06-21 -0.916348  0.976161 -0.450536  5.0  13
2022-06-22  0.628617  0.537878 -2.067756  5.0  14
2022-06-23  0.274019 -0.560243  0.089445  5.0  15
2022-06-24  0.317767 -0.304653 -0.395611  5.0  16
2022-06-25 -0.048513  0.653577  0.539982  5.0  17
2022-06-26 -0.158157 -0.073843 -0.141581  5.0  18
2022-06-27  0.525284 -0.979729  0.345773  5.0  19
2022-06-28  1.891567  0.348871 -1.245213  5.0  20

In [50]:
# setting values using a boolean selection (aka where clause)
df12[df12 > 0] = -df12
df12

                   A         B         C    D   F
2022-06-19  0.000000  0.000000 -0.431615 -5.0 -11
2022-06-20 -1.154874 -0.760429 -1.780735 -5.0 -12
2022-06-21 -0.916348 -0.976161 -0.450536 -5.0 -13
2022-06-22 -0.628617 -0.537878 -2.067756 -5.0 -14
2022-06-23 -0.274019 -0.560243 -0.089445 -5.0 -15
2022-06-24 -0.317767 -0.304653 -0.395611 -5.0 -16
2022-06-25 -0.048513 -0.653577 -0.539982 -5.0 -17
2022-06-26 -0.158157 -0.073843 -0.141581 -5.0 -18
2022-06-27 -0.525284 -0.979729 -0.345773 -5.0 -19
2022-06-28 -1.891567 -0.348871 -1.245213 -5.0 -20

# Missing Data

### _reindex_
change/add/delete index on a specified axis, returns a new dataframe

In [51]:
df13 = df.reindex(index=dates[0:4], columns=list(df.columns)+["G"])
df13

                   A         B         C         D   F   G
2022-06-19  0.516849  2.195446 -0.431615 -0.846499  11 NaN
2022-06-20  1.154874 -0.760429 -1.780735  1.034406  12 NaN
2022-06-21 -0.916348  0.976161 -0.450536 -0.975293  13 NaN
2022-06-22  0.628617  0.537878 -2.067756 -0.660797  14 NaN

### handling missing data
1. _```np.nan```_
1. _```pandas.isna()```_
1. ```df.dropna()```
1. ```df.fillna()```

In [52]:
# missing data in pandas is np.nan
df13.iat[1, 0] = np.nan
df13.iloc[1:, 5] = np.random.randint(1)
df13

                   A         B         C         D   F    G
2022-06-19  0.516849  2.195446 -0.431615 -0.846499  11  NaN
2022-06-20       NaN -0.760429 -1.780735  1.034406  12  0.0
2022-06-21 -0.916348  0.976161 -0.450536 -0.975293  13  0.0
2022-06-22  0.628617  0.537878 -2.067756 -0.660797  14  0.0

In [53]:
# get a boolean mask where values are NaN
df131 = pd.isna(df13)
df131

                A      B      C      D      F      G
2022-06-19  False  False  False  False  False   True
2022-06-20   True  False  False  False  False  False
2022-06-21  False  False  False  False  False  False
2022-06-22  False  False  False  False  False  False

In [54]:
# or just
pd.isna(df13)

                A      B      C      D      F      G
2022-06-19  False  False  False  False  False   True
2022-06-20   True  False  False  False  False  False
2022-06-21  False  False  False  False  False  False
2022-06-22  False  False  False  False  False  False

In [55]:
# the original is still there
df13

                   A         B         C         D   F    G
2022-06-19  0.516849  2.195446 -0.431615 -0.846499  11  NaN
2022-06-20       NaN -0.760429 -1.780735  1.034406  12  0.0
2022-06-21 -0.916348  0.976161 -0.450536 -0.975293  13  0.0
2022-06-22  0.628617  0.537878 -2.067756 -0.660797  14  0.0

In [56]:
# we are going to drop / replace values now, let's make a couple of copies of the dataframe
df132 = df13.copy()
df132

                   A         B         C         D   F    G
2022-06-19  0.516849  2.195446 -0.431615 -0.846499  11  NaN
2022-06-20       NaN -0.760429 -1.780735  1.034406  12  0.0
2022-06-21 -0.916348  0.976161 -0.450536 -0.975293  13  0.0
2022-06-22  0.628617  0.537878 -2.067756 -0.660797  14  0.0

In [57]:
# drop rows/columns that have missing data
# by default it returns a new dataframe, you may want to specify inplace=True for modifying current dataframe:
df_no_na = df132.dropna(how="any")
# how=‘any’ : If any NA values are present, drop that row or column.
# how=‘all’ : If all values are NA, drop that row or column.

In [58]:
# all rows/cols with missing data stripped
df_no_na

                   A         B         C         D   F    G
2022-06-21 -0.916348  0.976161 -0.450536 -0.975293  13  0.0
2022-06-22  0.628617  0.537878 -2.067756 -0.660797  14  0.0

In [59]:
# original still intact
df132

                   A         B         C         D   F    G
2022-06-19  0.516849  2.195446 -0.431615 -0.846499  11  NaN
2022-06-20       NaN -0.760429 -1.780735  1.034406  12  0.0
2022-06-21 -0.916348  0.976161 -0.450536 -0.975293  13  0.0
2022-06-22  0.628617  0.537878 -2.067756 -0.660797  14  0.0

In [60]:
# drop missing data from original
df132.dropna(how="any", inplace=True)
df132

                   A         B         C         D   F    G
2022-06-21 -0.916348  0.976161 -0.450536 -0.975293  13  0.0
2022-06-22  0.628617  0.537878 -2.067756 -0.660797  14  0.0

In [61]:
# fill missing data
df133 = df13.copy()
df133.fillna(np.pi*1000)

                      A         B         C         D   F            G
2022-06-19     0.516849  2.195446 -0.431615 -0.846499  11  3141.592654
2022-06-20  3141.592654 -0.760429 -1.780735  1.034406  12     0.000000
2022-06-21    -0.916348  0.976161 -0.450536 -0.975293  13     0.000000
2022-06-22     0.628617  0.537878 -2.067756 -0.660797  14     0.000000

# Align and Join

There needs to be a bigger notebook for this topic.
You need to know there's "joins" in Pandas just like in the SQL world, 
like join and left join and right join and inner and outer and all that...
Here we'll explore these in the context of the align function - 'aligning' the indexes of two dataframes.
Later we'll see these again in the context of _merging_ two data frames.

## Create two datasets with _mismatched_ indexes

In [62]:
# date range indexes
idx1 = pd.date_range('2022-01-01',periods = 10)
# 2022-01-01', '2022-01-02' don't exist in idx2
# '2022-01-11', '2022-01-12' don't exist in idx1
idx2 = pd.date_range('2022-01-03',periods = 10)

In [63]:
# dataframes from indexes
d1 = pd.DataFrame(index = idx1, data = 
    {
        'A': np.random.rand(10),
        'B': np.random.randint(1, high=25, size = 10)
    }
)

d2 = pd.DataFrame(index = idx2, data = 
    {
        'A': np.random.rand(10),
        'B': np.random.randint(1, high=25, size = 10)
    }
)

## Quick Aside: Rendering two dataframes side-by-side

The trick of rendering 2 dataframes side-by-side was from [this](https://stackoverflow.com/questions/38783027/jupyter-notebook-display-two-pandas-tables-side-by-side) stackoverflow question.

In [64]:
# we gon need to display both data frames side by side, so...
from IPython.display import display_html 
def render_df_side_by_side(a, b, a_title = "", b_title = ""):
    a_styler = a.style.set_table_attributes("style='display:inline'").set_caption(a_title)
    b_styler = b.style.set_table_attributes("style='display:inline'").set_caption(b_title)
    display_html(a_styler._repr_html_()+b_styler._repr_html_(), raw=True)

In [65]:
render_df_side_by_side(d1,d2)

,A,B
2022-01-01 00:00:00,0.263685,21
2022-01-02 00:00:00,0.913699,19
2022-01-03 00:00:00,0.417115,18
2022-01-04 00:00:00,0.735017,15
2022-01-05 00:00:00,0.535059,5
2022-01-06 00:00:00,0.241058,23
2022-01-07 00:00:00,0.182430,3
2022-01-08 00:00:00,0.365594,13
2022-01-09 00:00:00,0.662357,1
2022-01-10 00:00:00,0.461757,23
,A,B
2022-01-03 00:00:00,0.123370,18
2022-01-04 00:00:00,0.331096,20
2022-01-05 00:00:00,0.980851,3
2022-01-06 00:00:00,0.881818,24
2022-01-07 00:00:00,0.227652,14
2022-01-08 00:00:00,0.904886,1
2022-01-09 00:00:00,0.762181,20
2022-01-10 00:00:00,0.206356,23
2022-01-11 00:00:00,0.910520,17
2022-01-12 00:00:00,0.061782,1

Table rendering/styling options is [a bigger discussion](https://pandas.pydata.org/pandas-docs/stable/user_guide/style.html#) to be tackled later.

## .add, .sub, .mul, .div etc.

flexible wrappers (```add, sub, mul, div, mod, pow```) to arithmetic operators: ```+, -, *, /, //, %, **```

In [66]:
# the +, -, *, /, //, %, ** operations align indexes to create a UNION of indexes
d3 = d1+d2
d4 = d1.sub(d2) #equivalent to d1-d2
d5 = d1*d2
d6 = d1.div(d2)

In [67]:
# indexs not present in the other dataframe get a NaN

# pandas v1.x
# d3.style.highlight_null(null_color='red')

# pandas v2.x+
d3.style.highlight_null(color='red')

In [68]:
# sub
d4.style.highlight_null(color='red')

In [69]:
# mul
d5.style.highlight_null(color='red')

In [70]:
# div
d6.style.highlight_null(color='red')

### removing the NaN values from the resultant dataframe

In [71]:
# the + operation is UNION of indexes
d31 = d1+d2
# indexs not present in the other dataframe get a NaN
# do you can obvs remove nan values like before
d3.dropna().style.highlight_null(color='red')

## df.align()

Pandas [align](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.align.html) works to join the dataframes in interesting ways.

In [72]:
# align returns two dataframes - left and right as a result of a join
# default join is outer - the union of indices will be used as index for left and right
left, right = d1.align(d2, join='outer')
render_df_side_by_side(left, right)

,A,B
2022-01-01 00:00:00,0.263685,21.000000
2022-01-02 00:00:00,0.913699,19.000000
2022-01-03 00:00:00,0.417115,18.000000
2022-01-04 00:00:00,0.735017,15.000000
2022-01-05 00:00:00,0.535059,5.000000
2022-01-06 00:00:00,0.241058,23.000000
2022-01-07 00:00:00,0.182430,3.000000
2022-01-08 00:00:00,0.365594,13.000000
2022-01-09 00:00:00,0.662357,1.000000
2022-01-10 00:00:00,0.461757,23.000000
2022-01-11 00:00:00,nan,nan
2022-01-12 00:00:00,nan,nan
,A,B
2022-01-01 00:00:00,nan,nan
2022-01-02 00:00:00,nan,nan
2022-01-03 00:00:00,0.123370,18.000000
2022-01-04 00:00:00,0.331096,20.000000
2022-01-05 00:00:00,0.980851,3.000000
2022-01-06 00:00:00,0.881818,24.000000
2022-01-07 00:00:00,0.227652,14.000000
2022-01-08 00:00:00,0.904886,1.000000
2022-01-09 00:00:00,0.762181,20.000000
2022-01-10 00:00:00,0.206356,23.000000
2022-01-11 00:00:00,0.910520,17.000000
2022-01-12 00:00:00,0.061782,1.000000

In [73]:
# inner join
left, right = d1.align(d2, join='inner')
render_df_side_by_side(d1,d2)

,A,B
2022-01-01 00:00:00,0.263685,21
2022-01-02 00:00:00,0.913699,19
2022-01-03 00:00:00,0.417115,18
2022-01-04 00:00:00,0.735017,15
2022-01-05 00:00:00,0.535059,5
2022-01-06 00:00:00,0.241058,23
2022-01-07 00:00:00,0.182430,3
2022-01-08 00:00:00,0.365594,13
2022-01-09 00:00:00,0.662357,1
2022-01-10 00:00:00,0.461757,23
,A,B
2022-01-03 00:00:00,0.123370,18
2022-01-04 00:00:00,0.331096,20
2022-01-05 00:00:00,0.980851,3
2022-01-06 00:00:00,0.881818,24
2022-01-07 00:00:00,0.227652,14
2022-01-08 00:00:00,0.904886,1
2022-01-09 00:00:00,0.762181,20
2022-01-10 00:00:00,0.206356,23
2022-01-11 00:00:00,0.910520,17
2022-01-12 00:00:00,0.061782,1

In [74]:
# we can fill the NaNs with a certain value if needed
# let's fill with -100 so we can see it clearly
left, right = d1.align(d2, join='outer', fill_value = -100) 
render_df_side_by_side(left, right)

,A,B
2022-01-01 00:00:00,0.263685,21
2022-01-02 00:00:00,0.913699,19
2022-01-03 00:00:00,0.417115,18
2022-01-04 00:00:00,0.735017,15
2022-01-05 00:00:00,0.535059,5
2022-01-06 00:00:00,0.241058,23
2022-01-07 00:00:00,0.182430,3
2022-01-08 00:00:00,0.365594,13
2022-01-09 00:00:00,0.662357,1
2022-01-10 00:00:00,0.461757,23
2022-01-11 00:00:00,-100.000000,-100
2022-01-12 00:00:00,-100.000000,-100
,A,B
2022-01-01 00:00:00,-100.000000,-100
2022-01-02 00:00:00,-100.000000,-100
2022-01-03 00:00:00,0.123370,18
2022-01-04 00:00:00,0.331096,20
2022-01-05 00:00:00,0.980851,3
2022-01-06 00:00:00,0.881818,24
2022-01-07 00:00:00,0.227652,14
2022-01-08 00:00:00,0.904886,1
2022-01-09 00:00:00,0.762181,20
2022-01-10 00:00:00,0.206356,23
2022-01-11 00:00:00,0.910520,17
2022-01-12 00:00:00,0.061782,1

In [75]:
# left join: left index is added to right, but not the other way
left, right = d1.align(d2, join='left') 
render_df_side_by_side(left, right)

,A,B
2022-01-01 00:00:00,0.263685,21
2022-01-02 00:00:00,0.913699,19
2022-01-03 00:00:00,0.417115,18
2022-01-04 00:00:00,0.735017,15
2022-01-05 00:00:00,0.535059,5
2022-01-06 00:00:00,0.241058,23
2022-01-07 00:00:00,0.182430,3
2022-01-08 00:00:00,0.365594,13
2022-01-09 00:00:00,0.662357,1
2022-01-10 00:00:00,0.461757,23
,A,B
2022-01-01 00:00:00,nan,nan
2022-01-02 00:00:00,nan,nan
2022-01-03 00:00:00,0.123370,18.000000
2022-01-04 00:00:00,0.331096,20.000000
2022-01-05 00:00:00,0.980851,3.000000
2022-01-06 00:00:00,0.881818,24.000000
2022-01-07 00:00:00,0.227652,14.000000
2022-01-08 00:00:00,0.904886,1.000000
2022-01-09 00:00:00,0.762181,20.000000
2022-01-10 00:00:00,0.206356,23.000000

In [76]:
# right join: right index is added to left, but not the other way
left, right = d1.align(d2, join='right') 
render_df_side_by_side(left, right)

,A,B
2022-01-03 00:00:00,0.417115,18.000000
2022-01-04 00:00:00,0.735017,15.000000
2022-01-05 00:00:00,0.535059,5.000000
2022-01-06 00:00:00,0.241058,23.000000
2022-01-07 00:00:00,0.182430,3.000000
2022-01-08 00:00:00,0.365594,13.000000
2022-01-09 00:00:00,0.662357,1.000000
2022-01-10 00:00:00,0.461757,23.000000
2022-01-11 00:00:00,nan,nan
2022-01-12 00:00:00,nan,nan
,A,B
2022-01-03 00:00:00,0.123370,18
2022-01-04 00:00:00,0.331096,20
2022-01-05 00:00:00,0.980851,3
2022-01-06 00:00:00,0.881818,24
2022-01-07 00:00:00,0.227652,14
2022-01-08 00:00:00,0.904886,1
2022-01-09 00:00:00,0.762181,20
2022-01-10 00:00:00,0.206356,23
2022-01-11 00:00:00,0.910520,17
2022-01-12 00:00:00,0.061782,1

There's more to explore in align, and it can get confusing, so beginners be careful, take time and try to work out the result before you execute to build intuition.

# Operations on data

## Stats

Operations in general *exclude* missing data

In [77]:
# arithmetic mean, for each column (axis = 0)
df.mean()

A     0.418596
B     0.203304
C    -0.553785
D    -0.116878
F    15.500000
dtype: float64

In [78]:
# mean across a row (axis = 1)
df.mean(1)

2022-06-19    2.486836
2022-06-20    2.329623
2022-06-21    2.326797
2022-06-22    2.487589
2022-06-23    2.952289
2022-06-24    3.003574
2022-06-25    3.708505
2022-06-26    3.753767
2022-06-27    3.340381
2022-06-28    4.513113
Freq: D, dtype: float64

## Apply

In [79]:
# apply custom lambdas
df.apply(lambda x: x.max()-x.min())

A    2.807915
B    3.175175
C    2.607737
D    3.759764
F    9.000000
dtype: float64

In [80]:
df

                   A         B         C         D   F
2022-06-19  0.516849  2.195446 -0.431615 -0.846499  11
2022-06-20  1.154874 -0.760429 -1.780735  1.034406  12
2022-06-21 -0.916348  0.976161 -0.450536 -0.975293  13
2022-06-22  0.628617  0.537878 -2.067756 -0.660797  14
2022-06-23  0.274019 -0.560243  0.089445 -0.041778  15
2022-06-24  0.317767 -0.304653 -0.395611 -0.599631  16
2022-06-25 -0.048513  0.653577  0.539982  0.397480  17
2022-06-26 -0.158157 -0.073843 -0.141581  1.142416  18
2022-06-27  0.525284 -0.979729  0.345773 -2.189424  19
2022-06-28  1.891567  0.348871 -1.245213  1.570340  20

In [81]:
# each subsequent value is a sum of all values before it in the respective column
cumsum_df = df.apply(np.cumsum)
render_df_side_by_side(df, cumsum_df, "OG Dataframe", "Cumulative Sum")

,A,B,C,D,F
2022-06-19 00:00:00,0.516849,2.195446,-0.431615,-0.846499,11
2022-06-20 00:00:00,1.154874,-0.760429,-1.780735,1.034406,12
2022-06-21 00:00:00,-0.916348,0.976161,-0.450536,-0.975293,13
2022-06-22 00:00:00,0.628617,0.537878,-2.067756,-0.660797,14
2022-06-23 00:00:00,0.274019,-0.560243,0.089445,-0.041778,15
2022-06-24 00:00:00,0.317767,-0.304653,-0.395611,-0.599631,16
2022-06-25 00:00:00,-0.048513,0.653577,0.539982,0.397480,17
2022-06-26 00:00:00,-0.158157,-0.073843,-0.141581,1.142416,18
2022-06-27 00:00:00,0.525284,-0.979729,0.345773,-2.189424,19
2022-06-28 00:00:00,1.891567,0.348871,-1.245213,1.570340,20
,A,B,C,D,F
2022-06-19 00:00:00,0.516849,2.195446,-0.431615,-0.846499,11
2022-06-20 00:00:00,1.671723,1.435017,-2.212351,0.187907,23
2022-06-21 00:00:00,0.755375,2.411178,-2.662886,-0.787385,36
2022-06-22 00:00:00,1.383992,2.949057,-4.730642,-1.448183,50
2022-06-23 00:00:00,1.658012,2.388814,-4.641197,-1.489961,65
2022-06-24 00:00:00,1.975778,2.084161,-5.036808,-2.089592,81
2022-06-25 00:00:00,1.927265,2.737738,-4.496826,-1.692112,98
2022-06-26 00:00:00,1.769108,2.663894,-4.638407,-0.549696,116
2022-06-27 00:00:00,2.294392,1.684165,-4.292633,-2.739120,135
2022-06-28 00:00:00,4.185959,2.033035,-5.537846,-1.168780,155

## Histogramming

Frequencies, 'nuff said

```value_counts()```

In [82]:
series1 = pd.Series(np.random.randint(0,5, size = 25))
series1.value_counts()

3    7
0    6
1    5
4    4
2    3
Name: count, dtype: int64

## String Methods

In [83]:
# build a series
some_string = "SERIes and Index are EqUIppeD WITh A seT Of stRINg PROCESSING METHoDs In tHe ```sTR``` attrIBute THAT MakE IT eASy To oPerATE ON EACh ELEmeNt OF The aRrAY. NOtE thAt PAtTERN-maTching in ```sTR``` gENeralLY UsES reGUlAr eXpreSsiONs bY DEfault (aND In Some cases AlwayS uSEs tHeM)."
str_series = pd.Series(some_string.split()) # split splits on whitespace by default

In [84]:
# manipulating the case - lower, upper etc.
# also the length of each string, split, replace, yada yada...
# very important when cleaning data (column names may have stupid whitespace, bad case, spacing etc.)
low = str_series.str.lower()
up = str_series.str.upper()

low_up_df = pd.DataFrame(
    {
        'og': str_series,
        'length': str_series.str.len(),
        'low': low,
        'up': up,
        'split_low_on_i': low.str.split('i', expand = False), # expand = True will break this usecase, try elsewhere
        'replace_a_with_star_in_low': low.str.replace('a','*', case=False, regex=True) # yeah, you can mess with regular expns
    })

low_up_df.tail(10)

,og,length,low,up,split_low_on_i,replace_a_with_star_in_low
36,eXpreSsiONs,11,expressions,EXPRESSIONS,"[express, ons]",expressions
37,bY,2,by,BY,[by],by
38,DEfault,7,default,DEFAULT,[default],def*ult
39,(aND,4,(and,(AND,[(and],(*nd
40,In,2,in,IN,"[, n]",in
41,Some,4,some,SOME,[some],some
42,cases,5,cases,CASES,[cases],c*ses
43,AlwayS,6,always,ALWAYS,[always],*lw*ys
44,uSEs,4,uses,USES,[uses],uses
45,tHeM).,6,them).,THEM).,[them).],them).

See [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html#text-string-methods) for more string operations.

# Merge

Combine series and dataframes, use set logic for indexes and relational algebra for joins/merges

## Concat

Chill, we've done this before. The same join = inner/outer/left/right drill.

In [85]:
# let's make some more dataframes
concatDF = pd.DataFrame(np.random.randn(10,4)) # 10 rows and 4 columns of random numbers
pieces = [concatDF[:3], concatDF[3:7], concatDF[7:]]
reconstructedDF = pd.concat(pieces)
display('broken DFs: ',pieces)
render_df_side_by_side(concatDF, reconstructedDF, "OG", "Concatenated")

'broken DFs: '

[          0         1         2         3
 0 -0.432366 -0.119545 -0.153949  1.121927
 1 -1.687914  0.475201 -0.836731  0.202767
 2 -1.626976 -0.335689 -1.981017  1.229656,
           0         1         2         3
 3 -0.459588  1.042864 -1.424863 -2.522755
 4  0.383423 -1.387868 -0.418321 -0.021437
 5  0.006047  1.640699  0.055818  0.690031
 6 -0.805386 -1.233446 -0.896767 -0.499882,
           0         1         2         3
 7  0.447529  0.810787  0.503424  0.221449
 8  0.489673 -0.902749 -0.946638 -0.649604
 9 -0.060303  0.514115  0.184941  3.091788]

,0,1,2,3
0,-0.432366,-0.119545,-0.153949,1.121927
1,-1.687914,0.475201,-0.836731,0.202767
2,-1.626976,-0.335689,-1.981017,1.229656
3,-0.459588,1.042864,-1.424863,-2.522755
4,0.383423,-1.387868,-0.418321,-0.021437
5,0.006047,1.640699,0.055818,0.690031
6,-0.805386,-1.233446,-0.896767,-0.499882
7,0.447529,0.810787,0.503424,0.221449
8,0.489673,-0.902749,-0.946638,-0.649604
9,-0.060303,0.514115,0.184941,3.091788
,0,1,2,3
0,-0.432366,-0.119545,-0.153949,1.121927
1,-1.687914,0.475201,-0.836731,0.202767
2,-1.626976,-0.335689,-1.981017,1.229656
3,-0.459588,1.042864,-1.424863,-2.522755
4,0.383423,-1.387868,-0.418321,-0.021437
5,0.006047,1.640699,0.055818,0.690031
6,-0.805386,-1.233446,-0.896767,-0.499882
7,0.447529,0.810787,0.503424,0.221449
8,0.489673,-0.902749,-0.946638,-0.649604
9,-0.060303,0.514115,0.184941,3.091788

_From the [page](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#concat)_:
Adding a column to a DataFrame is relatively fast. However, adding a row requires a copy, and may be expensive. We recommend passing a pre-built list of records to the DataFrame constructor instead of building a DataFrame by iteratively appending records to it.

## Join
SQL style merges.

In [86]:
# two data frames
sl = pd.Series(np.random.randint(10, size=6))
sr = sl.shift(2).fillna(0).astype(int)
left = pd.DataFrame(
    {
        'key': list('ABCDEF'),
        'lval': sl
    }
)

right = pd.DataFrame(
    {
        'key': list('ABBCDE'),
        'rval': sr
    }
)

In [87]:
render_df_side_by_side(left, right, 'left', 'right')

,key,lval
0,A,0
1,B,0
2,C,2
3,D,4
4,E,4
5,F,7
,key,rval
0,A,0
1,B,0
2,B,0
3,C,0
4,D,2
5,E,4

In [88]:
result = pd.merge(left, right, on='key')
result

  key  lval  rval
0   A     0     0
1   B     0     0
2   B     0     0
3   C     2     0
4   D     4     2
5   E     4     4

# Grouping

"Group By" really means one or more of the following happening:
1. **Split**: data is broken into groups based on some criteria
2. **Apply**: a data operation is executed on each of those groups
3. **Combine**: the results are combined back into a data structure

In [89]:
grp_df = pd.DataFrame(
    {
        'colA': list('AABCAABDAA'),
        'colB': list('1234567890'),
        'colC': np.random.randn(10),
        'colD': np.random.randn(10)
    }
)
grp_df

  colA colB      colC      colD
0    A    1  0.231758 -0.415642
1    A    2 -0.236214 -0.178795
2    B    3 -0.599199 -0.332962
3    C    4  0.635060  0.307221
4    A    5  0.647307  0.162566
5    A    6 -0.055595  0.142542
6    B    7  0.638672  0.272814
7    D    8  0.247243 -0.773708
8    A    9 -0.471945  2.013728
9    A    0  0.855899 -0.374014

In [90]:
# a DataFrameGroupBy object object
grpby = grp_df.groupby('colA')

# list all the groups found
g = grpby.groups
g

{'A': [0, 1, 4, 5, 8, 9], 'B': [2, 6], 'C': [3], 'D': [7]}

In [91]:
# to create a dataframe from the group use something like
grpby.get_group('A')

  colA colB      colC      colD
0    A    1  0.231758 -0.415642
1    A    2 -0.236214 -0.178795
4    A    5  0.647307  0.162566
5    A    6 -0.055595  0.142542
8    A    9 -0.471945  2.013728
9    A    0  0.855899 -0.374014

### Find all the groups

In [92]:
# but we may not know all the groups in the dataframe.
# so got to find a way to list all groups as dataframes.
# 
# some basic python helps create a list of groupby names
grpby_labels_list = [*g.keys()] # using the unpacking operator *
# alternatively
# grpby_labels_list = list(g.keys())
grpby_labels_list

['A', 'B', 'C', 'D']

In [93]:
# create a dict where the group label is the key and the group dataframe is the value
grps = {lbl: grpby.get_group(lbl) for lbl in grpby_labels_list}

# now use the dict to access individual dataframes created out of the groupby operation
grps['B']

# question: can we create a dataframe of dataframes?

  colA colB      colC      colD
2    B    3 -0.599199 -0.332962
6    B    7  0.638672  0.272814

In [94]:
# You can see the datatype of the value is a pandas dataframe
type(grps['A'])

pandas.core.frame.DataFrame

In [95]:
# make a function of it all...
def get_all_groups(df_grpby):
    return {lbl: df_grpby.get_group(lbl) for lbl in list(df_grpby.groups.keys())}

In [96]:
grps = get_all_groups(grp_df.groupby('colA'))
grps

{'A':   colA colB      colC      colD
 0    A    1  0.231758 -0.415642
 1    A    2 -0.236214 -0.178795
 4    A    5  0.647307  0.162566
 5    A    6 -0.055595  0.142542
 8    A    9 -0.471945  2.013728
 9    A    0  0.855899 -0.374014,
 'B':   colA colB      colC      colD
 2    B    3 -0.599199 -0.332962
 6    B    7  0.638672  0.272814,
 'C':   colA colB     colC      colD
 3    C    4  0.63506  0.307221,
 'D':   colA colB      colC      colD
 7    D    8  0.247243 -0.773708}

In [97]:
# get a sum of values from each group
grp_df.groupby('colA').sum()

        colB      colC      colD
colA
A     125690  0.971211  1.350385
B         37  0.039473 -0.060148
C          4  0.635060  0.307221
D          8  0.247243 -0.773708

In [98]:
# let's add one more column to the dataframe
# we can try grouping on two columns
grp_df['colE'] = list('1231231231')
grp_df

  colA colB      colC      colD colE
0    A    1  0.231758 -0.415642    1
1    A    2 -0.236214 -0.178795    2
2    B    3 -0.599199 -0.332962    3
3    C    4  0.635060  0.307221    1
4    A    5  0.647307  0.162566    2
5    A    6 -0.055595  0.142542    3
6    B    7  0.638672  0.272814    1
7    D    8  0.247243 -0.773708    2
8    A    9 -0.471945  2.013728    3
9    A    0  0.855899 -0.374014    1

In [99]:
g2 = grp_df.groupby(['colA','colE'])
grps2 = get_all_groups(g2)
grps2

{('A',
  '1'):   colA colB      colC      colD colE
 0    A    1  0.231758 -0.415642    1
 9    A    0  0.855899 -0.374014    1,
 ('A',
  '2'):   colA colB      colC      colD colE
 1    A    2 -0.236214 -0.178795    2
 4    A    5  0.647307  0.162566    2,
 ('A',
  '3'):   colA colB      colC      colD colE
 5    A    6 -0.055595  0.142542    3
 8    A    9 -0.471945  2.013728    3,
 ('B',
  '1'):   colA colB      colC      colD colE
 6    B    7  0.638672  0.272814    1,
 ('B',
  '3'):   colA colB      colC      colD colE
 2    B    3 -0.599199 -0.332962    3,
 ('C',
  '1'):   colA colB     colC      colD colE
 3    C    4  0.63506  0.307221    1,
 ('D',
  '2'):   colA colB      colC      colD colE
 7    D    8  0.247243 -0.773708    2}

In [100]:
render_df_side_by_side(grps2[('A','1')], grps2[('A','2')], 'A,1', 'A,2')

,colA,colB,colC,colD,colE
0,A,1,0.231758,-0.415642,1
9,A,0,0.855899,-0.374014,1
,colA,colB,colC,colD,colE
1,A,2,-0.236214,-0.178795,2
4,A,5,0.647307,0.162566,2

# Reshaping

Stacking and Pivot Tables.
This really warrants more practice, at least go through [the page](https://pandas.pydata.org/pandas-docs/stable/user_guide/reshaping.html#)

## Stacking

In [101]:
tuples = list(
    zip(
        *[
            ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
            ["one", "two", "one", "two", "one", "two", "one", "two"],
        ]
    )
)

If the syntax [*expression](https://docs.python.org/dev/reference/expressions.html#calls) appears in the function call, expression must evaluate to an iterable. Elements from these iterables are treated as if they were additional positional arguments.

...although the *expression syntax may appear after explicit keyword arguments, it is processed before the keyword arguments (and any **expression arguments)

In [102]:
# starred expressions...
def f(a,b):
    print(a, ' ', b)
    
f (b=1, *(2,)) # works, the tuple (iterable) is expanded, 2 is assigned to a, then b fills the next argument slot
# f (a=1, *(2,)) # FAILS, multiple values for argument 'a'

2   1

In [103]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [104]:
stack_idx = pd.MultiIndex.from_tuples(tuples, names = ['first', 'second'])

In [105]:
stack_df = pd.DataFrame(np.random.randn(8,2), index = stack_idx, columns = ['a','b'])
stack_df

                     a         b
first second
bar   one     1.399752  1.104867
      two     2.257572  0.490835
baz   one     0.370797 -0.310939
      two    -0.096490  2.087477
foo   one    -0.385560  2.501992
      two     0.674896 -0.154312
qux   one     0.779276  1.059089
      two    -1.210043  3.257289

In [106]:
# stack really just combines the columns
stacked = stack_df.stack()
stacked

first  second
bar    one     a    1.399752
               b    1.104867
       two     a    2.257572
               b    0.490835
baz    one     a    0.370797
               b   -0.310939
       two     a   -0.096490
               b    2.087477
foo    one     a   -0.385560
               b    2.501992
       two     a    0.674896
               b   -0.154312
qux    one     a    0.779276
               b    1.059089
       two     a   -1.210043
               b    3.257289
dtype: float64

In [107]:
# unstacked brings back the two columns
# by default unstacks the last level
unstacked = stacked.unstack()
unstacked

                     a         b
first second
bar   one     1.399752  1.104867
      two     2.257572  0.490835
baz   one     0.370797 -0.310939
      two    -0.096490  2.087477
foo   one    -0.385560  2.501992
      two     0.674896 -0.154312
qux   one     0.779276  1.059089
      two    -1.210043  3.257289

In [108]:
stacked.unstack(1)

second        one       two
first
bar   a  1.399752  2.257572
      b  1.104867  0.490835
baz   a  0.370797 -0.096490
      b -0.310939  2.087477
foo   a -0.385560  0.674896
      b  2.501992 -0.154312
qux   a  0.779276 -1.210043
      b  1.059089  3.257289

In [109]:
stacked.unstack(0)

first          bar       baz       foo       qux
second
one    a  1.399752  0.370797 -0.385560  0.779276
       b  1.104867 -0.310939  2.501992  1.059089
two    a  2.257572 -0.096490  0.674896 -1.210043
       b  0.490835  2.087477 -0.154312  3.257289

In [110]:
# you can basically pivot the columns and rows using a combination of stack() and unstack()
unstacked.unstack()

               a                   b
second       one       two       one       two
first
bar     1.399752  2.257572  1.104867  0.490835
baz     0.370797 -0.096490 -0.310939  2.087477
foo    -0.385560  0.674896  2.501992 -0.154312
qux     0.779276 -1.210043  1.059089  3.257289

## Pivot Tables

In [111]:
# we're now just using data created in the pandas documentation - just cause, time.
pivot_tables_df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)
pivot_tables_df

        A  B    C         D         E
0     one  A  foo  0.444136  0.924781
1     one  B  foo  1.967271 -1.345390
2     two  C  foo -1.228525 -1.708172
3   three  A  bar  0.019861 -2.960868
4     one  B  bar  1.112396 -0.939254
5     one  C  bar  1.650048 -0.836505
6     two  A  foo  0.427204 -1.015996
7   three  B  foo  1.827979  0.021813
8     one  C  foo -0.561113  0.473242
9     one  A  bar  0.015788 -0.753523
10    two  B  bar -0.162859  0.605076
11  three  C  bar -0.016595  1.582530

In [112]:
# simple pivot tables - data, values to aggregate, index, columns to pivot along
pd.pivot_table(pivot_tables_df, values = 'D', index = ['A', 'B'], columns = ['C'])

C             bar       foo
A     B
one   A  0.015788  0.444136
      B  1.112396  1.967271
      C  1.650048 -0.561113
three A  0.019861       NaN
      B       NaN  1.827979
      C -0.016595       NaN
two   A       NaN  0.427204
      B -0.162859       NaN
      C       NaN -1.228525

In [113]:
# more'n one columns of values
# mark all NaN as zero (0)
pd.pivot_table(pivot_tables_df, values = ['D', 'E'], index = ['A', 'B'], columns = ['C']).fillna(0)

                D                   E
C             bar       foo       bar       foo
A     B
one   A  0.015788  0.444136 -0.753523  0.924781
      B  1.112396  1.967271 -0.939254 -1.345390
      C  1.650048 -0.561113 -0.836505  0.473242
three A  0.019861  0.000000 -2.960868  0.000000
      B  0.000000  1.827979  0.000000  0.021813
      C -0.016595  0.000000  1.582530  0.000000
two   A  0.000000  0.427204  0.000000 -1.015996
      B -0.162859  0.000000  0.605076  0.000000
      C  0.000000 -1.228525  0.000000 -1.708172

# Time Series

## Resample
We may need to resample data to a different time-frequency. 
Like get data every second and resample to data every 5 minutes and so on...

In [114]:
rng = pd.date_range('01/01/2022', periods = 1000, freq = 'S')

In [115]:
ts = pd.Series(np.random.randint(0,500, len(rng)), index=rng)

In [116]:
ts.resample('5min').sum()

2022-01-01 00:00:00    74241
2022-01-01 00:05:00    70225
2022-01-01 00:10:00    75454
2022-01-01 00:15:00    24455
Freq: 5T, dtype: int32

read up on [date offset strings](https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#dateoffset-objects) like '5min' etc.

## Timezones

In [117]:
# timezone representation
rng2 = pd.date_range('01/01/2022', periods = 500, freq='D')
ts2 = pd.Series(np.random.randint(0,365, len(rng2)), index=rng2)
ts2_utc = ts2.tz_localize('UTC')

In [118]:
# convert to US/Eastern
ts2_utc.tz_convert('US/Eastern')

2021-12-31 19:00:00-05:00    108
2022-01-01 19:00:00-05:00     40
2022-01-02 19:00:00-05:00    283
2022-01-03 19:00:00-05:00     66
2022-01-04 19:00:00-05:00    152
                            ...
2023-05-10 20:00:00-04:00     12
2023-05-11 20:00:00-04:00     54
2023-05-12 20:00:00-04:00     29
2023-05-13 20:00:00-04:00    165
2023-05-14 20:00:00-04:00    155
Freq: D, Length: 500, dtype: int32

## Time span representations

Converting between periods and timestamps.

Period is a _timespan_ - span of time between two timestamps.

In [119]:
# month - end of each 
rng3 = pd.date_range('01/01/2022', periods = 12, freq='M')
rng3

DatetimeIndex(['2022-01-31', '2022-02-28', '2022-03-31', '2022-04-30',
               '2022-05-31', '2022-06-30', '2022-07-31', '2022-08-31',
               '2022-09-30', '2022-10-31', '2022-11-30', '2022-12-31'],
              dtype='datetime64[ns]', freq='M')

In [120]:
ts3 = pd.Series(np.random.randn(len(rng3)), index = rng3)
ts3

2022-01-31   -0.282444
2022-02-28    0.367342
2022-03-31    1.751676
2022-04-30    1.087034
2022-05-31   -0.113045
2022-06-30    0.437777
2022-07-31    0.980494
2022-08-31    0.941416
2022-09-30   -0.869580
2022-10-31    0.580761
2022-11-30    0.990872
2022-12-31    0.434061
Freq: M, dtype: float64

In [121]:
ps = ts3.to_period()
ps

2022-01   -0.282444
2022-02    0.367342
2022-03    1.751676
2022-04    1.087034
2022-05   -0.113045
2022-06    0.437777
2022-07    0.980494
2022-08    0.941416
2022-09   -0.869580
2022-10    0.580761
2022-11    0.990872
2022-12    0.434061
Freq: M, dtype: float64

In [122]:
ps.to_timestamp()

2022-01-01   -0.282444
2022-02-01    0.367342
2022-03-01    1.751676
2022-04-01    1.087034
2022-05-01   -0.113045
2022-06-01    0.437777
2022-07-01    0.980494
2022-08-01    0.941416
2022-09-01   -0.869580
2022-10-01    0.580761
2022-11-01    0.990872
2022-12-01    0.434061
Freq: MS, dtype: float64

A more complex use-case:
convert a _quarterly frequency_ with _year ending in November_ to _9am_ of _the end of the month_ _following_ the _quarter end_

In [123]:
prng = pd.period_range('1990Q1', '2022Q4', freq='Q-NOV')
type(prng)

pandas.core.indexes.period.PeriodIndex

In [124]:
ts4 = pd.Series(np.random.randn(len(prng)), index=prng)
ts4.head()

1990Q1    0.214879
1990Q2   -0.148389
1990Q3    1.260150
1990Q4   -0.242816
1991Q1    0.392411
Freq: Q-NOV, dtype: float64

In [125]:
ts4.index = (prng.asfreq('M', 'e') +1).asfreq('H', 's')+9
ts4.head()

1990-03-01 09:00    0.214879
1990-06-01 09:00   -0.148389
1990-09-01 09:00    1.260150
1990-12-01 09:00   -0.242816
1991-03-01 09:00    0.392411
Freq: H, dtype: float64

# Categoricals

[This page](https://pandas.pydata.org/pandas-docs/stable/user_guide/categorical.html#categorical-data).

##### Note: With v2.0+ there's some changes to how categorical data works - so this sections needs an update.

For e.g., gender, social class, blood type, country affiliation, observation time or rating via Likert scales.
Categorical data. Categories allow (usually) fixed number of possible values. Categorical data may have some order, but not support numerical operations (for e.g., 'strongly agree', 'agree', 'disagree', 'strongly disagree').

In [126]:
cat_df = pd.DataFrame(
    {"id": list('123456'), "raw_grade":list('abbaae')}
)
cat_df

  id raw_grade
0  1         a
1  2         b
2  3         b
3  4         a
4  5         a
5  6         e

In [127]:
# convert the raw_grade col to categories
cat_df['grade'] = cat_df['raw_grade'].astype('category')
cat_df

  id raw_grade grade
0  1         a     a
1  2         b     b
2  3         b     b
3  4         a     a
4  5         a     a
5  6         e     e

In [128]:
# list of categories
cat_df['grade']

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

In [ ]:
# can give more meaningful names here
# direct assignment to Series.cat.categories()
cat_df['grade'].cat.categories = ['very good', 'meh', 'very bad']
cat_df['grade']

In [ ]:
cat_df

In [ ]:
# list of categories 
list(cat_df['grade'].cat.categories)

# categorical.CategoricalAccessor encapsulates all changes to categoricals
# for e.g., set_categories or remove_categories
# dir(cat_df['grade'].cat)

In [ ]:
# add more categories
cat_df['grade'] = cat_df['grade'].cat.set_categories(["very bad", "bad", "meh", "good", "very good"])
# new list of categories
list(cat_df['grade'].cat.categories)

In [ ]:
# now when we can sort the dataframe in order of categories (not lexical)
sorted_cat_df = cat_df.sort_values(by='grade')
render_df_side_by_side(cat_df, sorted_cat_df, 'OG', 'Sorted')

In [ ]:
# grouping
cat_grp = cat_df.groupby('grade')
cat_grp.get_group('very good')

In [ ]:
# count elements
cat_grp.size()